[
    { "text": "(press anywhere to begin!)" },
    { "text": "Hello, Arianna!" },
    { "text": "Happy Valentine's day." },
    { "text": "Unfortunately, I can't be with you in-person on this most special of days." },
    { "text": "So, instead, I have crawled inside of this website and dropped it into your browser!" },
    { "text": "See?? Here I am! So come follow me on a little V-day journey!", "image": "follow-me.jpg" },
    { "text": "But first - <a href='https://open.spotify.com/playlist/3QMF1onie8a6VdVdjgwiKZ?si=eefd1961549646fb&pt=2c84a5ab0de5ebc2296ad901f3ecb06c' target='_blank'>click here for a Spotify playlist!</a> I filled it with a few songs about how you make me feel (e.g. sweet, goopy, etc.). So, you should listen to it while you read this, and maybe throughout today when you get a chance, too :-)" },
    { "text": "Okay, perfect. Now, let's take a little trip down memory lane together, shall we?" },
    { "text": "How about all the way back to the beginning! This is the very first photo I have of you on my camera roll.", "image": "cool.jpg" },
    { "text": "Nowadays, you always tell me that you don't believe I think you're genuinely cool. Well, taking this photo is one of the first times I had that thought. I remember thinking \"holy crab. she just walked on out to the end of this dangerous log, and now she's making a badass expression while doing a nonchalant pose? not to mention she's wearing my sweater??? she is like the coolest girl ever!\". Yep, that's what I thought! Word for word!" },
    { "text": "Hahaha, and then you went crazy and started trying to punch me. I remember telling my friends afterwards \"Yeah she's insanely violent, she took me out alone in the woods and tried to kill me\" (jkjk i didn't say that lol)", "image": "punch.jpg" },
    { "text": "Well, luckily we were bein' all cute shortly after.", "image": "smiling.jpg" },
    { "text": "This picture was one of my first favorite pictures of ours. It's the first one I would show my friends and family. Weirdly, I can vividly remember standing on top of that rock and making some corny joke. I said \"This is my favorite rock in the whole woods!\". You said, \"Why?\", and I said \"Because you're here!\"" },
    { "text": "Maybe that was one of the first times I ever <em>got</em> you, hehehe." },
    { "text": "If I keep reminiscing in so much detail, this will take you a million years to read!! Let me jump forward a bit." },
    { "text": "How..." },
    { "text": "about....." },
    { "text": "THIS!", "image": "puppet.jpg" },
    { "text": "Hahaha, the puppet show. We were just talking about this yesterday!" },
    { "text": "(oh yeah, it's like 4am here in Boise as I write this. I woke up in the middle of the night with this idea in my brain and I immediately got up to do it lolol)" },
    { "text": "Anyway, yeah, the puppet show." },
    { "text": "I remember thinking the same exact thing Peter wrote in his story hahaha. How the hell did I find a girl who puts on a puppet show for me and my friends??? Again - another instance of you being so cool that my brain doesn't even know what to do." },
    { "text": "And then me very randomly/awkwardly asking you to be my girlfriend afterwards." },
    { "text": "I really enjoyed reminiscing about that moment with you, yesterday. And I'm glad you thought it was cute." },
    { "text": "In general, you always accept me for who I am - no matter if I'm weird, or have bad timing, or I won't even grow a shag mullet even though you keep telling me how cool it is." },
    { "text": "But that acceptance has been (and continues to be) worth so much to me. I've grown so much through our relationship, and I think we have both grown a lot together." },
    { "text": "Argh!! I'm getting distracted. I think I was reminiscing?" },
    { "text": "Let's see..." },
    { "text": "Maybe another special day..." },
    { "text": "A-ha! The day we said we Love each other, like with the capital L.", "image": "love.jpg" },
    { "text": "This is one of the photos from dinner at Forage. In general, that was one of the most awesomest days ever, from start to finish. But I think sitting and talking with you on that random park bench afterwards is a moment I'll cherish for the rest of my life." },
    { "text": "I remember the warm summer night air, and the golden glow of a few lampposts and streetlights. We were sitting alone on this comfy bench, definitely on Harvard property (trust me, I can tell)." },
    { "text": "Most people can't tell, but I can tell when it's Harvard." },
    { "text": "That's because I went there." },
    { "text": "I'm betting you're rolling your eyes right now, hahaha." },
    { "text": "Anyway. Mainly, what I remember from that night is how it felt to finally tell you out loud that I love you. I was like, \"thank god!!! I can't hold this shit in any longer!!\"" },
    { "text": "I had been sitting on it for a while, you know." },
    { "text": "And I remember feeling really special when you told me you love me, too. I knew that was pretty significant, based on what you had told me about some of your past suitors and their tendencies to start talking about love within the first week or two lololol" },
    { "text": "And it made me feel like you really trusted me. That's something I hold sacred, even to this day." },
    { "text": "Here's another pic from that night. What's up with the goofy face you're making??", "image": "goofy.jpg" },
    { "text": "And another one! This one's just cute, though.", "image": "cute.jpg" },
    { "text": "I love these super-blurry pics we get once in a while where we're just laughin' it up together." },
    { "text": "It feels like these kinds of pics capture the silliness at the heart of our relationship. A big part of why I love you :-) you're so fun to be silly with!" },
    { "text": "Here's another one that's like that, in my mind!", "image": "laugh.jpg" },
    { "text": "This is from when we visited RPI for my birthday - another special day, at least for me. It was really cool walking around this important place from earlier in my life and sharing some of those memories with you." },
    { "text": "I happened to snap this pic of you with this gigantic smile on your face, and in retrospect, it has become my favorite picture from that weekend!" },
    { "text": "I love the look of joy on your face - it perfectly mirrors how I was feeling being there with you, and snapping that photo :-)" },
    { "text": "I will say, I still maintain that I did NOT cheat at that card game with Tommy. My strategy was PERFECTLY within the rules, and you and everyone else was just mad because you didn't think of it first. Sorry I'm so smart!!!" },
    { "text": "I can't wait to find new ways to cheat at all the games we will play together for the rest of our lives :-)" },
    { "text": "Here's one more of my favorite pictures of us!", "image": "blueberries.jpg" },
    { "text": "I don't think there was any particularly special occasion about this day. Olivia organized a trip for her + us + Alec and Michy." },
    { "text": "I just remember feeling sooooo warm (like from the sun) and nice. I was lovin' MY outfit, I was lovin' YOUR outfit, I was lovin' crackin' jokes with this awesome group of people!" },
    { "text": "It was just such a warm, nice, beautiful summer day. And the way we are looking at each other in this picture is just the coolest thing ever." },
    { "text": "That's pretty much how I'm looking at you every single time I see you!" },
    { "text": "It's awesome." },
    { "text": "Okay, I think I'll pick just oooonnneee more pic to go into great detail about, before this whole deal gets so long and you get so bored." },
    { "text": "So, for my last one (for now)..." },
    { "text": "This one!", "image": "momofuku.jpg" },
    { "text": "This is from that random afternoon in NYC where it worked out for us to get lunch at Momofuku!" },
    { "text": "There are a lot of reasons why that whole trip was really special to me, but I think this lunch is the part that sticks out the most." },
    { "text": "I remember we had been strolling through Central Park, and you were telling me the plot of one of the Sailor Moon seasons." },
    { "text": "When we strolled into Momofuku and grabbed a seat at the bar, we looked into the back of the room. Lo and behold, a huge TV was playing a Sailor Moon episode!" },
    { "text": "I thought (and still think) that was a sign from the universe, that somehow, in some way, we are supposed to be together." },
    { "text": "I mean, I remember telling you about that bowl of noodles on our FIRST DATE!!! And you had been telling me about Sailor Moon for a while!" },
    { "text": "I can't really ignore both of those things coming together. It's too cool to be a coincidence. So, I'm gonna say it's not one!" },
    { "text": "Okayyyyy, since I can't resist... rapid-fire of a few other favorite photos of ours!!!" },
    { "text": "So what the hell's your plan with all this firewood, huh guy?", "image": "firewood.jpg" },
    { "text": "You looked so fucking good on goth night that it actually makes my heart start pounding even just remembering it.", "image": "goth.jpg" },
    { "text": "Lowkey same thing with the elf princess outfit. Any chance you still have that outfit somewhere?", "image": "elf.jpg" },
    { "text": "Here's an outfit that was just really cute, though. I had never done a couple's costume before, and I really appreciated the effort you put in to pull it together! It was also special for me to share our love for Over the Garden Wall!", "image": "otgw.jpg" },
    { "text": "And our mountain-top picnic, where you wine'd and dine'd me. I've maybe never been treated this nicely before in my life :-)", "image": "picnic.jpg" },
    { "text": "Now I'm done with the pictures for real!" },
    { "text": "So before we go, I'll leave you with a little limerick, since I was so charmed by the one you wrote for me in your card." },
    { "text": "*Ahem*" },
    { "text": "<i>I'm in love with this girl, Arianna</i>" },
    { "text": "<i>When I'm with her, it's like it's Nirvana</i>" },
    { "text": "<i>I love getting got,</i>" },
    { "text": "<i>And she gets me a lot,</i>" },
    { "text": "<i>So let's keep that all up, cuz I wanna!</i>" },
    { "text": "So there." },
    { "text": "Happy Valentine's day, my love. I know it's sad that we can't be together for it. But I'll be thinking of you non-stop (just like I usually am!) and sending all kinds of good vibes!" },
    { "text": "And if you want to read all this cheesy stuff again, you can either refresh the page or scroll back up." },
    { "text": "I love you." },
    { "text": "- Shmev <3" }
]
